etc/OpenFOAM_Sample_Files/outdoors_airflow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*Generated by Butterfly 0.0.1 https://github.com/mostaphaRoudsari/Butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		3.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		blockMeshDict;
}

convertToMeters 1;

vertices
(
(39.358626365661635 -12.130292415618825 28.252584457397461)
(39.358626365661635 139.49590921401983 0.0)
(-7.912170410156236 -12.130292415618825 0.0)
(-7.912170410156236 139.49590921401983 28.252584457397461)
(39.358626365661635 -12.130292415618825 0.0)
(39.358626365661635 139.49590921401983 28.252584457397461)
(-7.912170410156236 139.49590921401983 0.0)
(-7.912170410156236 -12.130292415618825 28.252584457397461)
);

blocks
(
   hex (4 1 6 2 0 5 3 7) (30 5 10) simpleGrading (3.0 1.0 2.0)
);

edges
(
);

boundary
(   inlet
   {
       type patch;
       faces
       (
            (2 4 0 7)
       );
   }

   outlet
   {
       type patch;
       faces
       (
            (1 6 3 5)
       );
   }

   rightSide
   {
       type patch;
       faces
       (
            (4 1 5 0)
       );
   }

   lefttSide
   {
       type patch;
       faces
       (
            (6 2 7 3)
       );
   }

   top
   {
       type patch;
       faces
       (
            (0 5 3 7)
       );
   }

   ground
   {
       type wall;
       faces
       (
            (4 2 6 1)
       );
   }
);

mergePatchPair
(
);
