etc/OpenFOAM_Sample_Files/outdoors_airflow/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*Generated by Butterfly 0.0.1 https://github.com/mostaphaRoudsari/Butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		3.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		snappyHexMeshDict;
}

castellatedMesh		true;

snap		true;

addLayers		true;

geometry
{

    outdoors_airflow.stl
    {

        type		triSurfaceMesh;

        name		outdoors_airflow;

        regions
        {

            buildings
            {

                name		buildings;

            }

        }

    }

}

castellatedMeshControls
{

    maxLocalCells		1000000;

    maxGlobalCells		2000000;

    minRefinementCells		10;

    maxLoadUnbalance		0.10;

    nCellsBetweenLevels		3;

    features		();

    refinementSurfaces
    {

        outdoors_airflow
        {

            level		(2 10);

            regions
            {

                buildings
                {

                    level		(1 6);

                }

            }

        }

    }

    resolveFeatureAngle		30;

    refinementRegions{}

    locationInMesh		(15.723227977752702 63.6828083992005 14.12629222869873);

    allowFreeStandingZoneFaces		true;

}

snapControls
{

    nSmoothPatch		3;

    tolerance		2;

    nSolveIter		30;

    nRelaxIter		5;

    implicitFeatureSnap		true;

    multiRegionFeatureSnap		true;

}

addLayersControls
{

    relativeSizes		true;

    layers{}

    expansionRatio		1.0;

    finalLayerThickness		0.3;

    minThickness		0.2;

    nGrow		0;

    featureAngle		60;

    nRelaxIter		3;

    nSmoothSurfaceNormals		1;

    nSmoothThickness		10;

    nSmoothNormals		3;

    maxFaceThicknessRatio		0.5;

    maxThicknessToMedialRatio		0.3;

    minMedianAxisAngle		90;

    nBufferCellsNoExtrude		0;

    nLayerIter		50;

    nRelaxedIter		20;

}

meshQualityControls
{

    maxNonOrtho		60;

    maxBoundarySkewness		20;

    maxInternalSkewness		4;

    maxConcave		80;

    minFlatness		0.5;

    minVol		1e-13;

    minTetQuality		1e-15;

    minArea		-1;

    minTwist		0.02;

    minDeterminant		0.001;

    minFaceWeight		0.02;

    minVolRatio		0.01;

    minTriangleTwist		-1;

    nSmoothScale		4;

    errorReduction		0.75;

}

debug		0;

mergeTolerance		1E-6;