etc/OpenFOAM_Sample_Files/outdoors_airflow/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*Generated by Butterfly 0.0.1 https://github.com/mostaphaRoudsari/Butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		3.0;
	format		ascii;
	class		volVectorField;
	location	"0";
	object		U;
}

dimensions		[0 1 -1 0 0 0 0];

#include		"initialConditions";

internalField		uniform $flowVelocity;

boundaryField
{

    rightSide
    {

        type		slip;

    }

    outlet
    {

        type		inletOutlet;

        inletValue		uniform (0 0 0);

        value		$internalField;

    }

    top
    {

        type		slip;

    }

    ground
    {

        type		fixedValue;

        value		uniform (0 0 0);

    }

    buildings
    {

        type		fixedValue;

        value		uniform (0 0 0);

    }

    inlet
    {

        type		atmBoundaryLayerInletVelocity;

        #include		"ABLConditions";

    }

    lefttSide
    {

        type		slip;

    }

}