etc/OpenFOAM_Sample_Files/outdoors_airflow/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*Generated by Butterfly 0.0.1 https://github.com/mostaphaRoudsari/Butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		3.0;
	format		ascii;
	class		volScalarField;
	location	"0";
	object		nut;
}

dimensions		[0 2 -1 0 0 0 0];

internalField		uniform 0;

boundaryField
{

    rightSide
    {

        type		calculated;

        value		uniform 0;

    }

    outlet
    {

        type		calculated;

        value		uniform 0;

    }

    top
    {

        type		calculated;

        value		uniform 0;

    }

    ground
    {

        type		nutkAtmRoughWallFunction;

        #include		"ABLConditions";

        value		uniform 0;

    }

    buildings
    {

        type		nutkWallFunction;

        value		uniform 0.0;

    }

    inlet
    {

        type		calculated;

        value		uniform 0;

    }

    lefttSide
    {

        type		calculated;

        value		uniform 0;

    }

}